backend/app/controllers/comments_controller.rb

    def create
        content = Content.find_by(id: params[:id])
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]