backend/app/controllers/contents_controller.rb

    def index
        contents = Content.all
---
SELECT "contents".* FROM "contents"

    def show
        content = Content.find(params[:id])
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        content = Content.new
        content.title = params[:title]
        content.url = params[:url]
        content.description = params[:image]
        content.image = params[:image]
        content.user_id = 1
        content.save
---
INSERT INTO "contents" ("url", "description", "image", "created_at", "updated_at", "user_id", "title") VALUES (?, ?, ?, ?, ?, ?, ?)  [["url", "sample.com"], ["description", "image"], ["image", "image"], ["created_at", "2020-01-29 10:42:17.644327"], ["updated_at", "2020-01-29 10:42:17.644327"], ["user_id", 1], ["title", "Sample"]]

    def destroy
        content = Content.find(params[:id])
        if content
            content.destroy
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", 100], ["LIMIT", 1]]
DELETE FROM "contents" WHERE "contents"."id" = ?  [["id", 13]]